Deadline039/STM32-Template/freertos_f4xx/User/Application/Inc/stm32f4xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32f4xx_hal_conf_template.h
  * @author  MCD Application Team
  * @brief   HAL configuration template file. 
  *          This file should be copied to the application folder and renamed
  *          to stm32f4xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

/* ########################## Module Selection ############################## */

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED

// <h> HAL 库配置选择

// <c> 启用 ADC (Analog-to-digital convert)
#define HAL_ADC_MODULE_ENABLED
// </c>

// <c> 启用 CAN (Controller area network)
#define HAL_CAN_MODULE_ENABLED
// </c>

// <c> 启用旧版 CAN (Controller area network)
// #define HAL_CAN_LEGACY_MODULE_ENABLED
// </c>

// <c> 启用 CEC (Consumer electronic controller)
#define HAL_CEC_MODULE_ENABLED
// </c>

// <c> 启用 CRC (CRC calculation unit)
#define HAL_CRC_MODULE_ENABLED
// </c>

// <c> 启用 CRYP (Cryptographic processor)
#define HAL_CRYP_MODULE_ENABLED
// </c>

// <c> 启用 DAC (Digital to analog converter)
#define HAL_DAC_MODULE_ENABLED
// </c>

// <c> 启用 DCMI (Digital camera interface)
#define HAL_DCMI_MODULE_ENABLED
// </c>

// <c> 启用 DMA (Direct memory access)
#define HAL_DMA_MODULE_ENABLED
// </c>

// <c> 启用 DMA2D
#define HAL_DMA2D_MODULE_ENABLED
// </c>

// <c> 启用 ETH (Ethernet controller)
#define HAL_ETH_MODULE_ENABLED
// </c>

// <c> 启用旧版 ETH (Ethernet controller)
// #define HAL_ETH_LEGACY_MODULE_ENABLED
// </c>

// <c> 启用 EXTI (External interrupt/event controller)
#define HAL_EXTI_MODULE_ENABLED
// </c>

// <c> 启用 FLASH (Flash memory)
#define HAL_FLASH_MODULE_ENABLED
// </c>

// <c> 启用 NAND (NAND Flash memory)
#define HAL_NAND_MODULE_ENABLED
// </c>

// <c> 启用 NOR (NOR Flash memory)
#define HAL_NOR_MODULE_ENABLED
// </c>

// <c> 启用 PCCARD (PC Card interface)
#define HAL_PCD_MODULE_ENABLED
// </c>

// <c> 启用 SRAM (SRAM external memory)
#define HAL_SRAM_MODULE_ENABLED
// </c>

// <c> 启用 SDRAM (Synchronous dynamic RAM)
#define HAL_SDRAM_MODULE_ENABLED
// </c>

// <c> 启用 GPIO (General purpose I/Os)
#define HAL_GPIO_MODULE_ENABLED
// </c>

// <c> 启用 HASH (Hash processor)
#define HAL_HASH_MODULE_ENABLED
// </c>

// <c> 启用 I2C (Inter-integrated circuit)
#define HAL_I2C_MODULE_ENABLED
// </c>

// <c> 启用 I2S (Inter-integrated sound)
#define HAL_I2S_MODULE_ENABLED
// </c>

// <c> 启用 SMBUS (System management bus)
#define HAL_SMBUS_MODULE_ENABLED
// </c>

// <c> 启用 IWDG (Independent watchdog)
#define HAL_IWDG_MODULE_ENABLED
// </c>

// <c> 启用 LTDC (LCD TFT display controller)
#define HAL_LTDC_MODULE_ENABLED
// </c>

// <c> 启用 DSI (Display serial interface)
#define HAL_DSI_MODULE_ENABLED
// </c>

// <c> 启用 PWR (Power controller)
#define HAL_PWR_MODULE_ENABLED
// </c>

// <c> 启用 QSPI (Quad-SPI Flash memory)
#define HAL_QSPI_MODULE_ENABLED
// </c>

// <c> 启用 RCC (Reset and clock controller)
#define HAL_RCC_MODULE_ENABLED
// </c>

// <c> 启用 RNG (Random number generator)
#define HAL_RNG_MODULE_ENABLED
// </c>

// <c> 启用 RTC (Real-time clock)
#define HAL_RTC_MODULE_ENABLED
// </c>

// <c> 启用 SAI (Serial audio interface)
#define HAL_SAI_MODULE_ENABLED
// </c>

// <c> 启用 SD (Secure digital)
#define HAL_SD_MODULE_ENABLED
// </c>

// <c> 启用 SPI (Serial peripheral interface)
#define HAL_SPI_MODULE_ENABLED
// </c>

// <c> 启用 TIM (Advanced-control, general-purpose or basic timer)
#define HAL_TIM_MODULE_ENABLED
// </c>

// <c> 启用 UART (Universal asynchronous receiver/transmitter)
#define HAL_UART_MODULE_ENABLED
// </c>

// <c> 启用 USART (Universal synchronous receiver/transmitter)
#define HAL_USART_MODULE_ENABLED
// </c>

// <c> 启用 IRDA (Infrared data association)
#define HAL_IRDA_MODULE_ENABLED
// </c>

// <c> 启用 SMARTCARD (Smartcard IC)
#define HAL_SMARTCARD_MODULE_ENABLED
// </c>

// <c> 启用 WWDG (Window watchdog)
#define HAL_WWDG_MODULE_ENABLED
// </c>

// <c> 启用 PCD (USB peripheral controller driver)
#define HAL_PCD_MODULE_ENABLED
// </c>

// <c> 启用 HCD (USB host controller driver)
#define HAL_HCD_MODULE_ENABLED
// </c>

// <c> 启用 FMPI2C (Fast-mode Plus Inter-integrated circuit)
#define HAL_FMPI2C_MODULE_ENABLED
// </c>

// <c> 启用 FMPSMBUS (Fast-mode Plus System Management Bus)
#define HAL_FMPSMBUS_MODULE_ENABLED
// </c>

// <c> 启用 SPDIFRX (SPDIF-RX Receiver interface)
#define HAL_SPDIFRX_MODULE_ENABLED
// </c>

// <c> 启用 DFSDM (Digital filter sigma delta modulator)
#define HAL_DFSDM_MODULE_ENABLED
// </c>

// <c> 启用 LPTIM (Low-power timer)
#define HAL_LPTIM_MODULE_ENABLED
// </c>

// <c> 启用 MMC (MultiMediaCard)
#define HAL_MMC_MODULE_ENABLED
// </c>

// </h>

/* ########################## HSE/HSI Values adaptation ##################### */

// <h> 时钟设置
#if !defined(HSE_VALUE)
// <o> HSE (外部高频振荡器) 频率 单位: Hz
#define HSE_VALUE 25000000UL
#endif /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
// <o> HSE 启动超时时间 单位: ms
#define HSE_STARTUP_TIMEOUT 100UL
#endif /* HSE_STARTUP_TIMEOUT */

#if !defined(HSI_VALUE)
// <o> HSI (内部高频振荡器) 频率 单位: Hz
#define HSI_VALUE 16000000UL
#endif /* HSI_VALUE */

#if !defined(LSE_VALUE)
// <o> LSE (外部低速振荡器) 频率 单位: Hz
#define LSE_VALUE 32768UL
#endif /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
// <o> LSE 启动超时时间 单位: ms
#define LSE_STARTUP_TIMEOUT 5000UL
#endif /* LSE_STARTUP_TIMEOUT */

#if !defined(LSI_VALUE)
// <o> LSI (内部低速振荡器) 典型频率 单位: Hz
//  <i> LSI 受温度与电压影响很大
#define LSI_VALUE 32000UL
#endif /* LSI_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT 5000U /*!< Time out for LSE start up, in ms */
#endif                            /* LSE_STARTUP_TIMEOUT */

#if !defined(EXTERNAL_CLOCK_VALUE)
// <o> 外部 I2S 时钟源频率
//  <i> I2S 计算时钟源的频率, 通过 I2S_CKIN 输入
#define EXTERNAL_CLOCK_VALUE 12288000UL
#endif /* EXTERNAL_CLOCK_VALUE */

