Deadline039/STM32-Template/freertos_f4xx/User/Application/Inc/stm32f4xx_hal_conf.h
// </h>

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */

// <h> 系统配置

// <o> VDD 供电电压 单位: mV
#define VDD_VALUE                            3300UL
// <o> SysTick 中断优先级
#define TICK_INT_PRIORITY                    15UL
// <q> 启用 RTOS (此宏不要启用, ST 预留接口)
#define USE_RTOS                             0
// <q> 启用预读取
#define PREFETCH_ENABLE                      1
// <q> 启用指令 Cache
#define INSTRUCTION_CACHE_ENABLE             1
// <q> 启用数据 Cache
#define DATA_CACHE_ENABLE                    1
// <q> 启用 SPI CRC 校验
#define USE_SPI_CRC                          1

// </h>

/* ########################## Register Callbacks selection ############################## */

// <h> 中断回调配置

//  <q> 启用 ADC (Analog-to-digital convert) 中断注册回调函数
#define USE_HAL_ADC_REGISTER_CALLBACKS       0
//  <q> 启用 CAN (Controller area network) 中断注册回调函数
#define USE_HAL_CAN_REGISTER_CALLBACKS       0
//  <q> 启用 CEC (Consumer electronic controller) 中断注册回调函数
#define USE_HAL_CEC_REGISTER_CALLBACKS       0
//  <q> 启用 CRYP (Cryptographic processor) 中断注册回调函数
#define USE_HAL_CRYP_REGISTER_CALLBACKS      0
//  <q> 启用 DAC (Digital to analog converter) 中断注册回调函数
#define USE_HAL_DAC_REGISTER_CALLBACKS       0
//  <q> 启用 DCMI (Digital camera interface) 中断注册回调函数
#define USE_HAL_DCMI_REGISTER_CALLBACKS      0
//  <q> 启用 DFSDM (Digital filter sigma delta modulator) 中断注册回调函数
#define USE_HAL_DFSDM_REGISTER_CALLBACKS     0
//  <q> 启用 DMA2D 中断注册回调函数
#define USE_HAL_DMA2D_REGISTER_CALLBACKS     0
//  <q> 启用 DSI (Display serial interface) 中断注册回调函数
#define USE_HAL_DSI_REGISTER_CALLBACKS       0
//  <q> 启用 ETH (Ethernet controller) 中断注册回调函数
#define USE_HAL_ETH_REGISTER_CALLBACKS       0
//  <q> 启用 HASH (Hash processor) 中断注册回调函数
#define USE_HAL_HASH_REGISTER_CALLBACKS      0
//  <q> 启用 HCD (USB host controller driver) 中断注册回调函数
#define USE_HAL_HCD_REGISTER_CALLBACKS       0
//  <q> 启用 I2C (Inter-integrated circuit) 中断注册回调函数
#define USE_HAL_I2C_REGISTER_CALLBACKS       0
//  <q> 启用 FMPI2C (Fast-mode Plus Inter-integrated circuit) 中断注册回调函数
#define USE_HAL_FMPI2C_REGISTER_CALLBACKS    0
//  <q> 启用 FMPSMBUS (Fast-mode System Management Bus) 中断注册回调函数
#define USE_HAL_FMPSMBUS_REGISTER_CALLBACKS  0
//  <q> 启用 I2S (Inter-integrated sound) 中断注册回调函数
#define USE_HAL_I2S_REGISTER_CALLBACKS       0
//  <q> 启用 IRDA (Infrared data association) 中断注册回调函数
#define USE_HAL_IRDA_REGISTER_CALLBACKS      0
//  <q> 启用 LPTIM (Low-power timer) 中断注册回调函数
#define USE_HAL_LPTIM_REGISTER_CALLBACKS     0
//  <q> 启用 LTDC (LCD TFT display controller) 中断注册回调函数
#define USE_HAL_LTDC_REGISTER_CALLBACKS      0
//  <q> 启用 MMC (MultiMediaCard) 中断注册回调函数
#define USE_HAL_MMC_REGISTER_CALLBACKS       0
//  <q> 启用 NAND Flash 中断注册回调函数
#define USE_HAL_NAND_REGISTER_CALLBACKS      0
//  <q> 启用 Nor Flash 中断注册回调函数
#define USE_HAL_NOR_REGISTER_CALLBACKS       0
//  <q> 启用 PC Card 中断注册回调函数
#define USE_HAL_PCCARD_REGISTER_CALLBACKS    0
//  <q> 启用 PCD (USB peripheral controller driver) 中断注册回调函数
#define USE_HAL_PCD_REGISTER_CALLBACKS       0
//  <q> 启用 QSPI (Quad-SPI Flash memory) 中断注册回调函数
#define USE_HAL_QSPI_REGISTER_CALLBACKS      0
//  <q> 启用 RNG (Random number generator) 中断注册回调函数
#define USE_HAL_RNG_REGISTER_CALLBACKS       0
//  <q> 启用 RTC (Real-time clock) 中断注册回调函数
#define USE_HAL_RTC_REGISTER_CALLBACKS       0
//  <q> 启用 SAI (Serial audio interface) 中断注册回调函数
#define USE_HAL_SAI_REGISTER_CALLBACKS       0
//  <q> 启用 SD (Secure digital) 中断注册回调函数
#define USE_HAL_SD_REGISTER_CALLBACKS        0
//  <q> 启用 SMARTCARD (Smartcard IC) 中断注册回调函数
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0
//  <q> 启用 SDRAM (Synchronous dynamic RAM) 中断注册回调函数
#define USE_HAL_SDRAM_REGISTER_CALLBACKS     0
//  <q> 启用 SRAM (SRAM external memory) 中断注册回调函数
#define USE_HAL_SRAM_REGISTER_CALLBACKS      0
//  <q> 启用 SPDIFRX (SPDIF-RX Receiver interface) 中断注册回调函数
#define USE_HAL_SPDIFRX_REGISTER_CALLBACKS   0
//  <q> 启用 SMBUS (System management bus) 中断注册回调函数
#define USE_HAL_SMBUS_REGISTER_CALLBACKS     0
//  <q> 启用 SPI (Serial peripheral interface) 中断注册回调函数
#define USE_HAL_SPI_REGISTER_CALLBACKS       0
//  <q> 启用 TIM (Advanced-control, general-purpose or basic timer) 中断注册回调函数
#define USE_HAL_TIM_REGISTER_CALLBACKS       0
//  <q> 启用 UART (Universal asynchronous receiver/transmitter) 中断注册回调函数
#define USE_HAL_UART_REGISTER_CALLBACKS      0
//  <q> 启用 USART (Universal synchronous receiver/transmitter) 中断注册回调函数
#define USE_HAL_USART_REGISTER_CALLBACKS     0
//  <q> 启用 WWDG (Window watchdog) 中断注册回调函数
#define USE_HAL_WWDG_REGISTER_CALLBACKS      0

// </h>

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */

// <c> 启用断言
//#define USE_FULL_ASSERT                      1U
// </c>

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

// <o> MAC 地址 0
#define ETH_MAC_ADDR0                        0x02UL
// <o> MAC 地址 1
#define ETH_MAC_ADDR1                        0x00UL
// <o> MAC 地址 2
#define ETH_MAC_ADDR2                        0x00UL
// <o> MAC 地址 3
#define ETH_MAC_ADDR3                        0x00UL
// <o> MAC 地址 4
#define ETH_MAC_ADDR4                        0x00UL
// <o> MAC 地址 5
#define ETH_MAC_ADDR5                        0x00UL

// <o> 接收缓冲区大小
#define ETH_RX_BUF_SIZE                      1528U
// <o> 接收缓冲区单个数据大小
#define ETH_RXBUFNB                          4U
// <o> 发送缓冲区大小
#define ETH_TX_BUF_SIZE                      1528U
// <o> 发送缓冲区单个数据大小
#define ETH_TXBUFNB                          4U

// </h>

//------------- <<< end of configuration section >>> ---------------------------

/* clang-format off */

/* Section 2: PHY configuration section */

/* DP83848 PHY Address*/ 
#define DP83848_PHY_ADDRESS             0x01U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/ 
#define PHY_RESET_DELAY                 0x000000FFU
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY                0x00000FFFU

#define PHY_READ_TO                     0x0000FFFFU
#define PHY_WRITE_TO                    0x0000FFFFU

/* Section 3: Common PHY Registers */

#define PHY_BCR                         ((uint16_t)0x0000)  /*!< Transceiver Basic Control Register   */
#define PHY_BSR                         ((uint16_t)0x0001)  /*!< Transceiver Basic Status Register    */
 
#define PHY_RESET                       ((uint16_t)0x8000)  /*!< PHY Reset */
#define PHY_LOOPBACK                    ((uint16_t)0x4000)  /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100)  /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000)  /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100)  /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000)  /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000)  /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200)  /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN                   ((uint16_t)0x0800)  /*!< Select the power down mode           */
#define PHY_ISOLATE                     ((uint16_t)0x0400)  /*!< Isolate PHY from MII                 */

